k6/load_manyDatas.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: load_manyDatas.js
     output: -

  scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
           * default: Up to 50 looping VUs for 30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 10/50 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10/50 VUs  01.0s/30.0s

running (0m02.0s), 20/50 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 20/50 VUs  02.0s/30.0s

running (0m03.0s), 30/50 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 30/50 VUs  03.0s/30.0s

running (0m04.0s), 39/50 VUs, 1 complete and 0 interrupted iterations
default   [  13% ] 39/50 VUs  04.0s/30.0s

running (0m05.0s), 49/50 VUs, 3 complete and 0 interrupted iterations
default   [  17% ] 49/50 VUs  05.0s/30.0s

running (0m06.0s), 50/50 VUs, 9 complete and 0 interrupted iterations
default   [  20% ] 50/50 VUs  06.0s/30.0s

running (0m07.0s), 50/50 VUs, 10 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  07.0s/30.0s

running (0m08.0s), 50/50 VUs, 10 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  08.0s/30.0s

running (0m09.0s), 50/50 VUs, 14 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  09.0s/30.0s

running (0m10.0s), 50/50 VUs, 18 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  10.0s/30.0s

running (0m11.0s), 50/50 VUs, 20 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  11.0s/30.0s

running (0m12.0s), 50/50 VUs, 20 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  12.0s/30.0s

running (0m13.0s), 50/50 VUs, 23 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  13.0s/30.0s

running (0m14.0s), 50/50 VUs, 27 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  14.0s/30.0s

running (0m15.0s), 50/50 VUs, 29 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  15.0s/30.0s

running (0m16.0s), 50/50 VUs, 31 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  16.0s/30.0s

running (0m17.0s), 50/50 VUs, 31 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  17.0s/30.0s

running (0m18.0s), 50/50 VUs, 37 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  18.0s/30.0s

running (0m19.0s), 50/50 VUs, 39 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  19.0s/30.0s

running (0m20.0s), 50/50 VUs, 40 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  20.0s/30.0s

running (0m21.0s), 50/50 VUs, 41 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  21.0s/30.0s

running (0m22.0s), 50/50 VUs, 45 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  22.0s/30.0s

running (0m23.0s), 50/50 VUs, 48 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  23.0s/30.0s

running (0m24.0s), 50/50 VUs, 49 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  24.0s/30.0s

running (0m25.0s), 50/50 VUs, 51 complete and 0 interrupted iterations
default   [  83% ] 50/50 VUs  25.0s/30.0s

running (0m26.0s), 48/50 VUs, 54 complete and 0 interrupted iterations
default   [  87% ] 48/50 VUs  26.0s/30.0s

running (0m27.0s), 48/50 VUs, 59 complete and 0 interrupted iterations
default   [  90% ] 48/50 VUs  27.0s/30.0s

running (0m28.0s), 48/50 VUs, 59 complete and 0 interrupted iterations
default   [  93% ] 48/50 VUs  28.0s/30.0s

running (0m29.0s), 48/50 VUs, 61 complete and 0 interrupted iterations
default   [  97% ] 48/50 VUs  29.0s/30.0s

running (0m30.0s), 46/50 VUs, 63 complete and 0 interrupted iterations
default   [ 100% ] 46/50 VUs  30.0s/30.0s

running (0m31.0s), 41/50 VUs, 68 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m32.0s), 40/50 VUs, 69 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m33.0s), 39/50 VUs, 70 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m34.0s), 36/50 VUs, 73 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m35.0s), 31/50 VUs, 78 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m36.0s), 30/50 VUs, 79 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m37.0s), 29/50 VUs, 80 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m38.0s), 26/50 VUs, 83 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m39.0s), 23/50 VUs, 86 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m40.0s), 20/50 VUs, 89 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m41.0s), 20/50 VUs, 89 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m42.0s), 16/50 VUs, 93 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m43.0s), 13/50 VUs, 96 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m44.0s), 10/50 VUs, 99 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m45.0s), 10/50 VUs, 99 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m46.0s), 08/50 VUs, 101 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m47.0s), 05/50 VUs, 104 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

running (0m47.8s), 00/50 VUs, 109 complete and 0 interrupted iterations
default ↓ [ 100% ] 46/50 VUs  30s

     ✓ page loading complete

     checks.........................: 100.00% ✓ 109      ✗ 0   
     data_received..................: 8.1 MB  170 kB/s
     data_sent......................: 65 kB   1.4 kB/s
     http_req_blocked...............: avg=3.43ms   min=2.71µs   med=2.96µs  max=32.68ms  p(90)=8.22ms   p(95)=12ms    
     http_req_connecting............: avg=689.49µs min=0s       med=0s      max=7.19ms   p(90)=1.66ms   p(95)=2.27ms  
   ✗ http_req_duration..............: avg=15.32s   min=2.82s    med=19.11s  max=21.18s   p(90)=20.1s    p(95)=20.41s  
       { expected_response:true }...: avg=15.32s   min=2.82s    med=19.11s  max=21.18s   p(90)=20.1s    p(95)=20.41s  
     http_req_failed................: 0.00%   ✓ 0        ✗ 109 
     http_req_receiving.............: avg=13.36ms  min=956.34µs med=9.83ms  max=53.38ms  p(90)=27.47ms  p(95)=34.16ms 
     http_req_sending...............: avg=99.18µs  min=46.08µs  med=86.18µs max=200.27µs p(90)=140.49µs p(95)=153.86µs
     http_req_tls_handshaking.......: avg=2.64ms   min=0s       med=0s      max=28.53ms  p(90)=5.7ms    p(95)=8.62ms  
     http_req_waiting...............: avg=15.31s   min=2.81s    med=19.08s  max=21.18s   p(90)=20.09s   p(95)=20.4s   
     http_reqs......................: 109     2.282303/s
     iteration_duration.............: avg=16.33s   min=3.85s    med=20.11s  max=22.19s   p(90)=21.1s    p(95)=21.41s  
     iterations.....................: 109     2.282303/s
     vus............................: 5       min=5      max=50
     vus_max........................: 50      min=50     max=50